Configuration/InformationRegisters/МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МестоПозицииШтатногоРасписанияВСтруктуреПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УВМ_ДолжностьУпр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_ДолжностиУпр</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетСтруктуреЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/InformationRegisters/МестоПозицииШтатногоРасписанияВСтруктуреПредприятия/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьТекущиеПодразделенияПозиций(Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьВторичныеДанные(Замещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьТекущиеПодразделенияПозиций(Замещение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокПозиций", РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ЭтотОбъект, Замещение, "Позиция"));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МестоПозиции.Позиция КАК Позиция,
		|	МестоПозиции.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТПодразделенияПозиций
		|ИЗ
		|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозиции
		|ГДЕ
		|	МестоПозиции.Позиция В(&СписокПозиций)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодразделенияПозиций.Позиция КАК Позиция
		|ИЗ
		|	ВТПодразделенияПозиций КАК ПодразделенияПозиций";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТекущиеПодразделенияПозиций", Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ОбновитьВторичныеДанные(Замещение)
	
	ЕстьЗаписиВСтаромНаборе = ДополнительныеСвойства.Свойство("ТекущиеПодразделенияПозиций");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокПозиций", РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ЭтотОбъект, Замещение, "Позиция"));
	Если ЕстьЗаписиВСтаромНаборе Тогда
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ТекущиеПодразделенияПозиций;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	МестоПозиции.Позиция КАК Позиция,
			|	МестоПозиции.Подразделение КАК МестоВСтруктуреПредприятия,
			|	ПодразделенияПозиций.Подразделение КАК СтароеМестоВСтруктуреПредприятия
			|ПОМЕСТИТЬ ВТМестаВСтруктуреПредприятияПозицийПредварительно
			|ИЗ
			|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозиции
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодразделенияПозиций КАК ПодразделенияПозиций
			|		ПО (МестоПозиции.Позиция В (&СписокПозиций))
			|			И МестоПозиции.Позиция = ПодразделенияПозиций.Позиция
			|ГДЕ
			|	МестоПозиции.Подразделение <> ПодразделенияПозиций.Подразделение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МестоПозиции.Позиция КАК Позиция,
			|	МестоПозиции.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
			|	МестоПозиции.СтароеМестоВСтруктуреПредприятия КАК СтароеМестоВСтруктуреПредприятия
			|ПОМЕСТИТЬ ВТМестаВСтруктуреПредприятияПозиций
			|ИЗ
			|	ВТМестаВСтруктуреПредприятияПозицийПредварительно КАК МестоПозиции
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПодразделенияПозиций.Позиция,
			|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
			|	ПодразделенияПозиций.Подразделение
			|ИЗ
			|	ВТПодразделенияПозиций КАК ПодразделенияПозиций
			|ГДЕ
			|	НЕ ПодразделенияПозиций.Позиция В
			|				(ВЫБРАТЬ
			|					Т.Позиция
			|				ИЗ
			|					ВТМестаВСтруктуреПредприятияПозицийПредварительно КАК Т)";
		Запрос.Выполнить();
		
		ИнтеграцияУправлениеПерсоналомСобытияРасширенный.ПриЗаписиМестаПозицииШтатногоРасписанияВСтруктуреПредприятия(
			ДополнительныеСвойства.ТекущиеПодразделенияПозиций, Неопределено, Неопределено);
	Иначе
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	МестоПозиции.Позиция КАК Позиция,
			|	МестоПозиции.Подразделение КАК МестоВСтруктуреПредприятия,
			|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК СтароеМестоВСтруктуреПредприятия
			|ПОМЕСТИТЬ ВТМестаВСтруктуреПредприятияПозиций
			|ИЗ
			|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозиции
			|ГДЕ
			|	МестоПозиции.Позиция В (&СписокПозиций)";
		Запрос.Выполнить();
		
		ИнтеграцияУправлениеПерсоналомСобытияРасширенный.ПриЗаписиМестаПозицииШтатногоРасписанияВСтруктуреПредприятия(
			Неопределено, ЭтотОбъект, Замещение);
	КонецЕсли;
		
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодразделенияПозиций.Позиция КАК Позиция
		|ИЗ
		|	ВТМестаВСтруктуреПредприятияПозиций КАК ПодразделенияПозиций";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеПодбораСотрудников(Запрос);
	ОбновитьСведенияПодразделений(Запрос);
	
КонецПроцедуры

Процедура ОбновитьДанныеПодбораСотрудников(Запрос)
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МестаВСтруктуреПредприятияПозиций.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
		|	ДанныеДляПодбора.ИдентификаторЗаписи КАК ИдентификаторЗаписи
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМестаВСтруктуреПредприятияПозиций КАК МестаВСтруктуреПредприятияПозиций
		|		ПО ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию = МестаВСтруктуреПредприятияПозиций.Позиция";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ДанныеДляПодбораСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(Выборка.ИдентификаторЗаписи);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.МестоВСтруктуреПредприятия = Выборка.МестоВСтруктуреПредприятия;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;	

КонецПроцедуры

Процедура ОбновитьСведенияПодразделений(Запрос)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьИсториюИзмененияШтатногоРасписания") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МестаВСтруктуреПредприятияПозиций.МестоВСтруктуреПредприятия КАК Подразделение
		|ИЗ
		|	ВТМестаВСтруктуреПредприятияПозиций КАК МестаВСтруктуреПредприятияПозиций
		|ГДЕ
		|	МестаВСтруктуреПредприятияПозиций.МестоВСтруктуреПредприятия <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МестаВСтруктуреПредприятияПозиций.СтароеМестоВСтруктуреПредприятия
		|ИЗ
		|	ВТМестаВСтруктуреПредприятияПозиций КАК МестаВСтруктуреПредприятияПозиций
		|ГДЕ
		|	МестаВСтруктуреПредприятияПозиций.СтароеМестоВСтруктуреПредприятия <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
	
	Подразделения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");
	
	Если Подразделения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОрганизационнаяСтруктура.ОбновитьСведенияПодразделений(Подразделения);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
